name: "custom_Power"
input: "data"
input_dim: 1
input_dim: 3
input_dim: 16
input_dim: 16

layer {
	bottom: "data"
	top: "out"
	name: "custom_Power"
	type: "custom_Power"
	custom_power_param {
    }
}

