name: "custom_upsample"
input: "data"
input_dim: 1
input_dim: 3
input_dim: 16
input_dim: 16

layer {
    bottom: "data"
    top: "custom_upsample"
    name: "custom_upsample"
    type: "custom_Upsample"
    custom_upsample_param {
        scale: 2
    }
}
